<template>
  <be-ellipsis
      :elpNum="10"
      placement="left"
      text="点绛唇·闺思 寂寞深闺，柔肠一寸愁千缕。惜春春去，几点催花雨。 倚遍阑干，只是无情绪。人何处，连天芳草，望断归来路。"
      content="点绛唇·闺思 寂寞深闺，柔肠一寸愁千缕。惜春春去，几点催花雨。 倚遍阑干，只是无情绪。人何处，连天芳草，望断归来路。">
  </be-ellipsis>


  <be-ellipsis
      :elpNum="10"
      placement="center"
      text="浣溪沙 淡荡春光寒食天，玉炉沉水袅残烟。梦回山枕隐花钿。海燕未来人斗草，江梅已过柳生绵。黄昏疏雨湿秋千。"
      content="浣溪沙 淡荡春光寒食天，玉炉沉水袅残烟。梦回山枕隐花钿。海燕未来人斗草，江梅已过柳生绵。黄昏疏雨湿秋千。">
  </be-ellipsis>


  <be-ellipsis
      :elpNum="16"
      placement="right"
      text="南歌子 天上星河转，人间帘幕垂。凉生枕簟泪痕滋。起解罗衣聊问夜何其。 翠贴莲蓬小，金销藕叶稀。旧时天气旧时衣。只有情怀不似旧家时"
      content="南歌子 天上星河转，人间帘幕垂。凉生枕簟泪痕滋。起解罗衣聊问夜何其。 翠贴莲蓬小，金销藕叶稀。旧时天气旧时衣。只有情怀不似旧家时">
  </be-ellipsis>
</template>
